{
  "id": "5LwhbAGNc",
  "data": {
    "content": {
      "type": "doc",
      "content": [
        {
          "type": "orderedList",
          "attrs": {
            "start": 1
          },
          "content": [
            {
              "type": "listItem",
              "content": [
                {
                  "type": "paragraph",
                  "attrs": {
                    "textAlign": "left"
                  },
                  "content": [
                    {
                      "text": "Provides context and introduces the onboarding or task sequence using a title or message to succinctly communicate the overarching goal or status of the tasks.",
                      "type": "text"
                    }
                  ]
                }
              ]
            },
            {
              "type": "listItem",
              "content": [
                {
                  "type": "paragraph",
                  "attrs": {
                    "textAlign": "left"
                  },
                  "content": [
                    {
                      "text": "Wraps the onboarding cards in a collapsible format, which can be expanded or collapsed to show or hide the cards, helping manage screen real estate and focus.",
                      "type": "text"
                    }
                  ]
                }
              ]
            },
            {
              "type": "listItem",
              "content": [
                {
                  "type": "paragraph",
                  "attrs": {
                    "textAlign": "left"
                  },
                  "content": [
                    {
                      "text": "Visual indicator showing the user's progression through the onboarding steps, typically represented as \"X/Y Complete,\" which helps motivate and guide users through the setup process.",
                      "type": "text"
                    }
                  ]
                }
              ]
            },
            {
              "type": "listItem",
              "content": [
                {
                  "type": "paragraph",
                  "attrs": {
                    "textAlign": "left"
                  },
                  "content": [
                    {
                      "text": "Positioned prominently to allow users to bypass the entire onboarding process or task list, enabling those familiar with the system to quickly move past introductory tasks.",
                      "type": "text"
                    }
                  ]
                }
              ]
            },
            {
              "type": "listItem",
              "content": [
                {
                  "type": "paragraph",
                  "attrs": {
                    "textAlign": "left"
                  },
                  "content": [
                    {
                      "text": "An icon button that changes state (e.g., up/down arrow) to control the expansion or collapse of the accordion container, indicating whether the accordion is open or closed.",
                      "type": "text"
                    }
                  ]
                }
              ]
            },
            {
              "type": "listItem",
              "content": [
                {
                  "type": "paragraph",
                  "attrs": {
                    "textAlign": "left"
                  },
                  "content": [
                    {
                      "text": "Positioned at the edges of the card carousel, these buttons allow users to view additional cards by navigating left or right through the onboarding card carousel.",
                      "type": "text"
                    }
                  ]
                }
              ]
            },
            {
              "type": "listItem",
              "content": [
                {
                  "type": "paragraph",
                  "attrs": {
                    "textAlign": "left"
                  },
                  "content": [
                    {
                      "text": "Individual containers for each task or step in the onboarding process, which include icons, titles, descriptions, and a call-to-action(CTA) button specific to each task, providing a clear and actionable path for users.",
                      "type": "text"
                    }
                  ]
                }
              ]
            },
            {
              "type": "listItem",
              "content": [
                {
                  "type": "paragraph",
                  "attrs": {
                    "textAlign": "left"
                  },
                  "content": [
                    {
                      "text": "Dots or other markers that indicate the current slide within the carousel and the total number of slides, with the currently active card highlighted in a darker shade to clearly show the user's position within the sequence.",
                      "type": "text"
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  },
  "blockType": "text-editor"
}
